def book_list_view(library):
    for key in library:
        print(key, "-", library[key]["наличие"])


library = {
    "Гарри Поттер и философский камень": {
        "автор": "Дж. К. Роулинг",
        "год": 1997,
        "наличие": "в наличии"
    },
    "Война и мир": {
        "автор": "Лев Толстой",
        "год": 1869,
        "наличие": "выдана"
    },
    "1984": {
        "автор": "Джордж Оруэлл",
        "год": 1949,
        "наличие": "в наличии"
    },
    "Мастер и Маргарита": {
        "автор": "Михаил Булгаков",
        "год": 1967,
        "наличие": "в наличии"
    }
}

book_list_view(library)
